Revit 2016 API
Document.NewAreaLoad Method (IList<XYZ>, XYZ, Boolean, AreaLoadType)
Creates a new uniform unhosted area load with polygonal shape within the project.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2016. Use AreaLoad.Create() method instead.")]
public AreaLoad NewAreaLoad(
	IList<XYZ> points,
	XYZ force,
	bool isReaction,
	AreaLoadType symbol
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2016. Use AreaLoad.Create() method instead.")> _
Public Function NewAreaLoad ( _
	points As IList(Of XYZ), _
	force As XYZ, _
	isReaction As Boolean, _
	symbol As AreaLoadType _
) As AreaLoad
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2016. Use AreaLoad.Create() method instead.")]
public:
AreaLoad^ NewAreaLoad(
	IList<XYZ^>^ points,
	XYZ^ force,
	bool isReaction,
	AreaLoadType^ symbol
)
Parameters
points
Type: System.Collections.Generic.IList<XYZ>
Vertexes of AreaLoad shape polygon.
force
Type: Autodesk.Revit.DB.XYZ
The applied 3d area force.
isReaction
Type: System.Boolean
Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol
Type: Autodesk.Revit.DB.Structure.AreaLoadType
The symbol of the AreaLoad.
Return Value
If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned if the operation fails.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | If the product is not Revit Structure.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the area load symbol does not exist in the given document.
See Also
Document Class
NewAreaLoad Overload
Autodesk.Revit.Creation Namespace